import { Box, List, ListItem, ListItemText } from "@mui/material";
import SEO from "components/SEO";
import { FlexRowCenter } from "components/flex-box";
import { H1, H3, H4 } from "components/Typography";
import MainLayout from "components/layouts/MainLayout";

const Terms = () => {
  return (
    <>
      <SEO title="Общи условия | Beeds.bg" />
      <MainLayout>
        <FlexRowCenter
          style={{
            paddingTop: 50,
            paddingBottom: 50,
            paddingRight: 200,
            paddingLeft: 200,
          }}
          flexWrap="wrap"
          flexDirection="column"
        >
          <Box>
            <H1>Общи условия за ползване</H1>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Настоящите Общи условия са предназначени за регулиране на
              отношенията между “Бийдс” Фондация, вписана в Търговския регистър
              и регистъра на ЮЛНЦ към Агенция по вписванията с ЕИК: 123456789,
              със седалище и адрес на управление: Европейски съюз, Република
              България, ж.к. Лозенец, бул. Арсеналски 51, София 1421, определена
              за извършване на дейност в обществена полза, наричана по-долу за
              краткост „Beeds“, „Фондацията” „ние“, „нас“, и Ползвателите,
              наричани по-долу „Създатели на Кампании“, „Дарители“, „Вие“,
              „Вас“, по повод предоставяните от нас възможности за използване на
              Платформата, създадена за споделяне и събиране на дарения.
            </p>
          </Box>
        </FlexRowCenter>
        <Box
          style={{
            paddingRight: 200,
            paddingLeft: 200,
          }}
        >
          <Box>
            <H3>Съдържание</H3>
          </Box>
          <List dense>
            <ListItem>
              <ListItemText primary="Общи условия за ползване" />
            </ListItem>
            <ListItem>
              <ListItemText primary="1. ДЕФИНИЦИИ" />
            </ListItem>
            <ListItem>
              <ListItemText primary="2. ОБОБЩЕНА ИНФОРМАЦИЯ" />
            </ListItem>
            <ListItem>
              <ListItemText primary="3. УСЛОВИЯ ЗА ПОЛЗВАНЕ НА ПЛАТФОРМАТА" />
            </ListItem>
            <ListItem>
              <ListItemText primary="4. ИНТЕЛЕКТУАЛНА СОБСТВЕНОСТ" />
            </ListItem>
            <ListItem>
              <ListItemText primary="5. ОТГОВОРНОСТ. ИЗКЛЮЧВАНЕ И ОГРАНИЧАВАНЕ НА ОТГОВОРНОСТТА" />
            </ListItem>
            <ListItem>
              <ListItemText primary="6. БИСКВИТКИ (COOKIES)" />
            </ListItem>
            <ListItem>
              <ListItemText primary="7. СИГУРНОСТ И ЗАЩИТА НА ЛИЧНИТЕ ДАННИ" />
            </ListItem>
            <ListItem>
              <ListItemText primary="8. ПРИЛОЖИМО ПРАВО И ЮРИСДИКЦИЯ" />
            </ListItem>
            <ListItem>
              <ListItemText primary="9. ОБЩИ РАЗПОРЕДБИ" />
            </ListItem>
          </List>
        </Box>
        <Box
          style={{
            paddingTop: 20,
            paddingRight: 200,
            paddingLeft: 200,
          }}
        >
          <Box>
            <H4>1. ДЕФИНИЦИИ</H4>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Бенефициер/Ползващо се лице – физическо лице, организация, група
              лица, животни, проект, в полза на които/за изпълнение на който е
              създадена Кампания и което е крайният получател на дарените
              парични средства под условие. За целите на настоящите Условия
              Ползващо се лице е и лицето, което има право да се разпорежда с
              дарените по Кампанията парични средства под условие (напр.
              родител/настойник/наследник/организатор).
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Бисквитки - текстов файл, който се съхранява на Вашия компютър или
              преносимо устройство от сървъра на Уебсайта, като впоследствие
              този сървър може да възстанови или да прочете съдържанието на
              съответната „бисквитка“. „Бисквитките“ подпомагат оптимизацията и
              осигуряването на пълно и качествено ползване на функционалностите
              на Уебсайта, като съхраняват Вашите настройки, така че не е нужно
              да ги въвеждате отново всеки път, когато посетите нова страница.
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Дарител - всяко българско или чуждестранно физическо или
              юридическо лице, което направи дарение по Кампания, независимо от
              стойността на дарението.
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Кампания - проект или кауза, създадена с помощта на Платформата, с
              цел събиране на дарения за благотворителни цели.
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Хиперлинк - електронна връзка от една уебстраница към 1) други
              уебстраници в същия уебсайт или 2) уебстраници част от друг
              уебсайт. По- специфично – хиперлинк е връзката между една страница
              от хипертекст документ към друга.
            </p>
          </Box>
        </Box>
        <Box
          style={{
            paddingTop: 20,
            paddingBottom: 50,
            paddingRight: 200,
            paddingLeft: 200,
          }}
        >
          <Box>
            <H4>2. ОБОБЩЕНА ИНФОРМАЦИЯ</H4>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Бенефициер/Ползващо се лице – физическо лице, организация, група
              лица, животни, проект, в полза на които/за изпълнение на който е
              създадена Кампания и което е крайният получател на дарените
              парични средства под условие. За целите на настоящите Условия
              Ползващо се лице е и лицето, което има право да се разпорежда с
              дарените по Кампанията парични средства под условие (напр.
              родител/настойник/наследник/организатор).
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Бисквитки - текстов файл, който се съхранява на Вашия компютър или
              преносимо устройство от сървъра на Уебсайта, като впоследствие
              този сървър може да възстанови или да прочете съдържанието на
              съответната „бисквитка“. „Бисквитките“ подпомагат оптимизацията и
              осигуряването на пълно и качествено ползване на функционалностите
              на Уебсайта, като съхраняват Вашите настройки, така че не е нужно
              да ги въвеждате отново всеки път, когато посетите нова страница.
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Дарител - всяко българско или чуждестранно физическо или
              юридическо лице, което направи дарение по Кампания, независимо от
              стойността на дарението.
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Кампания - проект или кауза, създадена с помощта на Платформата, с
              цел събиране на дарения за благотворителни цели.
            </p>
          </Box>
          <Box>
            <p style={{ fontSize: "16px" }}>
              Хиперлинк - електронна връзка от една уебстраница към 1) други
              уебстраници в същия уебсайт или 2) уебстраници част от друг
              уебсайт. По- специфично – хиперлинк е връзката между една страница
              от хипертекст документ към друга.
            </p>
          </Box>
        </Box>
      </MainLayout>
    </>
  );
};
export default Terms;
